In [14]:
people = {
    'first':['Charan','Amit','Yash'],
    'last' :['Shetty','Trivedi','Patel'],
    'email':['cshetty@gmail.com','atrived@gmail.com','ypatel@gmail.com']
}

In [15]:
import pandas as pd
df = pd.DataFrame(people)
df

    first     last              email
0  Charan   Shetty  cshetty@gmail.com
1    Amit  Trivedi  atrived@gmail.com
2    Yash    Patel   ypatel@gmail.com

In [16]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [17]:
df.columns = ['first_name','last_name','email_id']

In [18]:
df.columns

Index(['first_name', 'last_name', 'email_id'], dtype='object')

In [19]:
df

  first_name last_name           email_id
0     Charan    Shetty  cshetty@gmail.com
1       Amit   Trivedi  atrived@gmail.com
2       Yash     Patel   ypatel@gmail.com

In [20]:
df.columns = ['FIRST_NAME','LAST_NAME','EMAIL_ID']
df.columns = [x.upper() for x in df.columns]
df.rename(columns={'first_name':'FIRST_NAME','last_name':'LAST_NAME',
                   'email_id':'EMAIL_ID'},inplace=True)

  FIRST_NAME LAST_NAME           EMAIL_ID
0     Charan    Shetty  cshetty@gmail.com
1       Amit   Trivedi  atrived@gmail.com
2       Yash     Patel   ypatel@gmail.com

In [21]:
df.columns=df.columns.str.replace('_',' ')

In [22]:
df

  FIRST NAME LAST NAME           EMAIL ID
0     Charan    Shetty  cshetty@gmail.com
1       Amit   Trivedi  atrived@gmail.com
2       Yash     Patel   ypatel@gmail.com

In [23]:
df.columns = df.columns.str.replace(' ','_')
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name           email_id
0     Charan    Shetty  cshetty@gmail.com
1       Amit   Trivedi  atrived@gmail.com
2       Yash     Patel   ypatel@gmail.com

In [24]:
df.rename(columns={'first_name':'first','last_name':'last'},inplace=True)

In [25]:
df

    first     last           email_id
0  Charan   Shetty  cshetty@gmail.com
1    Amit  Trivedi  atrived@gmail.com
2    Yash    Patel   ypatel@gmail.com

In [26]:
df.loc[2]

first                   Yash
last                   Patel
email_id    ypatel@gmail.com
Name: 2, dtype: object

In [59]:
df.loc[2]=['James','Bond','jbond@gmail.com']

In [60]:
df.loc[2]=['James','Bond','jbond@gmail.com']
df.loc[2,['first','last','email_id']]= ['James','Bond','jbond@gmail.com']
filt = df['last']=='Bond'
df[filt,['first','last','email_id']] = ['James','Bond','jbond@gmail.com']
df

   first     last           email_id
0  Rohit   Shetty  CSHETTY@GMAIL.COM
1   Anil  Trivedi  ATRIVED@GMAIL.COM
2  James     Bond    jbond@gmail.com

In [29]:
df.loc[2,['last','email_id']]

last                   Bond
email_id    jbond@gmail.com
Name: 2, dtype: object

In [30]:
df.loc[2,['first','last','email_id']]= ['Yash','Patel','ypatel@gmail.com']

In [31]:
df

    first     last           email_id
0  Charan   Shetty  cshetty@gmail.com
1    Amit  Trivedi  atrived@gmail.com
2    Yash    Patel   ypatel@gmail.com

In [32]:
df.loc[2,['last']]=['Mehta']

In [33]:
df

    first     last           email_id
0  Charan   Shetty  cshetty@gmail.com
1    Amit  Trivedi  atrived@gmail.com
2    Yash    Mehta   ypatel@gmail.com

In [34]:
filt = df['last']=='Mehta'
df.loc[filt,'email_id']=['ymehta@gmail.com']

In [35]:
df

    first     last           email_id
0  Charan   Shetty  cshetty@gmail.com
1    Amit  Trivedi  atrived@gmail.com
2    Yash    Mehta   ymehta@gmail.com

In [36]:
df['email_id'] = df['email_id'].str.upper()
df

    first     last           email_id
0  Charan   Shetty  CSHETTY@GMAIL.COM
1    Amit  Trivedi  ATRIVED@GMAIL.COM
2    Yash    Mehta   YMEHTA@GMAIL.COM

In [37]:
df['email_id'].apply(len)

0    17
1    17
2    16
Name: email_id, dtype: int64

In [38]:
def loweremail(email):
    return email.lower()

In [39]:
df['email_id'].apply(loweremail)

0    cshetty@gmail.com
1    atrived@gmail.com
2     ymehta@gmail.com
Name: email_id, dtype: object

In [40]:
df

    first     last           email_id
0  Charan   Shetty  CSHETTY@GMAIL.COM
1    Amit  Trivedi  ATRIVED@GMAIL.COM
2    Yash    Mehta   YMEHTA@GMAIL.COM

In [41]:
df['email_id']=df['email_id'].apply(loweremail)

In [42]:
df

    first     last           email_id
0  Charan   Shetty  cshetty@gmail.com
1    Amit  Trivedi  atrived@gmail.com
2    Yash    Mehta   ymehta@gmail.com

In [43]:
df['email_id']=df['email_id'].apply(lambda x:x.upper())
df

    first     last           email_id
0  Charan   Shetty  CSHETTY@GMAIL.COM
1    Amit  Trivedi  ATRIVED@GMAIL.COM
2    Yash    Mehta   YMEHTA@GMAIL.COM

In [44]:
df['email_id'].apply(len)

0    17
1    17
2    16
Name: email_id, dtype: int64

In [45]:
df.apply(len)

first       3
last        3
email_id    3
dtype: int64

In [46]:
df.apply(len,axis='columns')

0    3
1    3
2    3
dtype: int64

In [47]:
len(df['email_id'])

3

In [48]:
df.apply(pd.Series.min)

first                    Amit
last                    Mehta
email_id    ATRIVED@GMAIL.COM
dtype: object

In [49]:
df.apply(lambda x:x.min())

first                    Amit
last                    Mehta
email_id    ATRIVED@GMAIL.COM
dtype: object

In [50]:
df.applymap(len)

   first  last  email_id
0      6     6        17
1      4     7        17
2      4     5        16

In [51]:
df

    first     last           email_id
0  Charan   Shetty  CSHETTY@GMAIL.COM
1    Amit  Trivedi  ATRIVED@GMAIL.COM
2    Yash    Mehta   YMEHTA@GMAIL.COM

In [52]:
df.applymap(str.lower)

    first     last           email_id
0  charan   shetty  cshetty@gmail.com
1    amit  trivedi  atrived@gmail.com
2    yash    mehta   ymehta@gmail.com

In [53]:
df

    first     last           email_id
0  Charan   Shetty  CSHETTY@GMAIL.COM
1    Amit  Trivedi  ATRIVED@GMAIL.COM
2    Yash    Mehta   YMEHTA@GMAIL.COM

In [54]:
df['first'].map({'Charan':'Rohit','Amit':'Anil'})

0    Rohit
1     Anil
2      NaN
Name: first, dtype: object

In [55]:
df['first'].replace({'Charan':'Rohit','Amit':'Anil'})

0    Rohit
1     Anil
2     Yash
Name: first, dtype: object

In [56]:
df['first']=df['first'].replace({'Charan':'Rohit','Amit':'Anil'})

In [57]:
df

   first     last           email_id
0  Rohit   Shetty  CSHETTY@GMAIL.COM
1   Anil  Trivedi  ATRIVED@GMAIL.COM
2   Yash    Mehta   YMEHTA@GMAIL.COM